In [1]:
#establish onnection

import mysql.connector as sql

connection = sql.connect(host='localhost', user='Kulashree', password = '260399')
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000217CD20EA00>

In [2]:
cursor = connection.cursor()

In [3]:
cursor.execute('show databases')
for x in cursor:
    print(x)

('information_schema',)
('internshiptask',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [4]:
cursor.execute('use internshiptask')

In [5]:
cursor.execute("show tables")
for x in cursor:
    print(x)

('bonus',)
('customer',)
('emp',)
('employee',)
('orders',)
('title',)
('worker',)

In [6]:
cursor.execute('desc worker')
for x in cursor:
    print(x)

('WORKER_ID', b'int', 'YES', '', None, '')
('FIRST_NAME', b'varchar(10)', 'YES', '', None, '')
('LAST_NAME', b'varchar(10)', 'YES', '', None, '')
('SALARY', b'int', 'YES', '', None, '')
('JOINING_DATE', b'datetime', 'YES', '', None, '')
('DEPARTMENT', b'varchar(10)', 'YES', '', None, '')

In [7]:
cursor.execute('select * from worker')
for x in cursor:
    print(x)

(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(2, 'Niharika', 'Verma', 80000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(4, 'Amitabh', 'Singh', 500000, datetime.datetime(2014, 2, 20, 9, 0), 'Admin')
(5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(6, 'Vipul', 'Diwan', 200000, datetime.datetime(2014, 6, 11, 9, 0), 'Account')
(7, 'Satish', 'Kumar', 75000, datetime.datetime(2014, 1, 20, 9, 0), 'Account')
(8, 'Geetika', 'Chauhan', 90000, datetime.datetime(2014, 4, 11, 9, 0), 'Admin')

In [8]:
# Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>

cursor.execute("select FIRST_NAME as 'WORKER_NAME' from worker")

In [9]:
cursor.fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

In [10]:
#Write an SQL query to fetch “FIRST_NAME” from Worker table in upper case

cursor.execute("select upper(FIRST_NAME) from Worker")

In [11]:
cursor.fetchall()

[('MONIKA',),
 ('NIHARIKA',),
 ('VISHAL',),
 ('AMITABH',),
 ('VIVEK',),
 ('VIPUL',),
 ('SATISH',),
 ('GEETIKA',)]

In [12]:
#Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

cursor.execute("select distinct(DEPARTMENT) from Worker")

In [13]:
cursor.fetchall()

[('HR',), ('Admin',), ('Account',)]

In [14]:
#Write an SQL query to print the first three characters of FIRST_NAME from Worker table

cursor.execute("select substring(FIRST_NAME, 1,3) from Worker")

In [15]:
cursor.fetchall()

[('Mon',),
 ('Nih',),
 ('Vis',),
 ('Ami',),
 ('Viv',),
 ('Vip',),
 ('Sat',),
 ('Gee',)]

In [16]:
# Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

cursor.execute("select distinct length(DEPARTMENT) from Worker")

In [17]:
cursor.fetchall()

[(2,), (5,), (7,)]

In [18]:
# Write an SQL query to print the FIRST_NAME and LAST_NAME from Worker table into a single column COMPLETE_NAME. A space char should separate them.

cursor.execute("select concat(FIRST_NAME,' ', LAST_NAME) from Worker")

In [19]:
cursor.fetchall()

[('Monika Arora',),
 ('Niharika Verma',),
 ('Vishal Singhal',),
 ('Amitabh Singh',),
 ('Vivek Bhati',),
 ('Vipul Diwan',),
 ('Satish Kumar',),
 ('Geetika Chauhan',)]

In [20]:
# Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending

cursor.execute("select * from Worker order by FIRST_NAME asc")

In [21]:
cursor.fetchall()

[(4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')]

In [22]:
# Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

cursor.execute("select * from Worker order by FIRST_NAME asc , DEPARTMENT desc")

In [23]:
cursor.fetchall()

[(4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')]

In [24]:
# Write an SQL query to print details for Workers with the first name as “Vipul” and “Satish” from Worker table.

cursor.execute("select * from Worker where FIRST_NAME ='Vipul' or FIRST_NAME='Satish'")

In [25]:
cursor.fetchall()

[(6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account')]

In [26]:
# Write an SQL query to print details of Workers with DEPARTMENT name as “Admin”.

cursor.execute("select * from Worker where DEPARTMENT ='Admin'")

In [27]:
cursor.fetchall()

[(2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

In [28]:
# Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

cursor.execute("select * from Worker where FIRST_NAME like '_____h%'")

In [29]:
cursor.fetchall()

[(7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account')]

In [30]:
# Write an SQL query to print details of the Workers whose SALARY lies between 100000 and 500000

cursor.execute("select * from Worker where (SALARY>=100000 and SALARY<=500000)")

In [31]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account')]

In [32]:
# Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000

cursor.execute("select concat(FIRST_NAME, ' ', LAST_NAME) as Worker_Name from Worker where (SALARY>=50000 and SALARY<=100000)")

In [33]:
cursor.fetchall()

[('Monika Arora',),
 ('Niharika Verma',),
 ('Satish Kumar',),
 ('Geetika Chauhan',)]

In [34]:
# Write an SQL query to fetch the no. of workers for each department in the descending order.

cursor.execute("select DEPARTMENT, count(DEPARTMENT) FROM Worker group by DEPARTMENT")

In [35]:
cursor.fetchall()

[('HR', 2), ('Admin', 4), ('Account', 2)]